var creerData = [
	{
		id : "1",
		position : "硬件项目经理",
		site : "北京",
		experience : "3年以上",
		specialty : "计算机专业",
		email : "",
		content : '<p class="blue-color">岗位职责</p>' + 
        '<p>1. 立项阶段跟踪产品定义及需求，和研发测试等相关部门一起制定产品开发计划</p>' + 
        '<p>2. 研发阶段跟踪产品研发进度，组织节点评审，保证项目里程碑的完成</p>' + 
        '<p>3. 生产阶段做为和工厂的接口人，跟踪物料齐套，结构进度，完成产品的研发打样，小批量生产及量产的全过程</p>' + 
        '<p>4. 试产备料及试产安排，试产问题整理并跟踪组织解决；模具开模进度情况确认</p>' + 
        '<p>5. 跟踪产品售后及RMA问题总结，并及时反馈给相关部门</p>' + 
        '<p>6. 以产品质量为核心，协调项目资源，及时做好相关部门沟通，合理控制成本，保证项目进度、监控项目质量</p>' + 
        '<p class="blue-color">任职资格</p>' + 
        '<p>1. 电子、通讯，结构类等相关专业本科以上学历</p>' + 
        '<p>2. 三年以上通信，电子等行业项目管理经验</p>' + 
        '<p>3. 熟悉通信，电子等产品工厂生产流程</p>' + 
        '<p>4. 良好的沟通能力和合作意识，服从管理，能承受较大工作压力，主动为项目各节点的质量把关</p>' + 
        '<p>5. 工作思路清晰，有条理，较强的预见性及前瞻能力，具有一定的管理能力</p>'
	},
	{
		id : "2",
		position : "新媒体运营经理",
		site : "北京",
		experience : "3年以上",
		specialty : "计算机/网络专业",
		email : "",
		content : '<p class="blue-color">岗位职责</p>' + 
        '<p>1. 负责公司线上的推广策划</p>' + 
        '<p>2. 公司线上平台的运维（微信、微博等）</p>' + 
        '<p>3. 对线上材料内容审核</p>' + 
        '<p class="blue-color">任职资格</p>' + 
        '<p>1. 对新媒体拥有全面的了解</p>' + 
        '<p>2. 创意性强，可以针对行业定制不同的推广策略</p>' + 
        '<p>3. 有工业行业工作经验者优先</p>'
	},
	{
		id : "3",
		position : "高级文案策划",
		site : "北京",
		experience : "3年以上",
		specialty : "中文/新闻传播专业",
		email : "",
		content : '<p class="blue-color">岗位职责</p>' + 
        '<p>1. 产品相关材料撰写策划</p>' + 
        '<p>2. 公司和产品材料的文案市场包装</p>' + 
        '<p>3. 材料内容、文案审核以及优化工作</p>' + 
        '<p class="blue-color">任职资格</p>' + 
        '<p>1. 文笔好，擅长多种文风写作</p>' + 
        '<p>2. IT、工业等行业工作经历</p>' + 
        '<p>3. 思维活跃，年轻有活力，创新性好</p>'
	},
	{
		id : "4",
		position : "新媒体运营经理",
		site : "北京",
		experience : "3年以上",
		specialty : "计算机/网络专业",
		email : "",
		content : '<p class="blue-color">岗位职责</p>' + 
        '<p>1. 负责公司线上的推广策划</p>' + 
        '<p>2. 公司线上平台的运维（微信、微博等）</p>' + 
        '<p>3. 对线上材料内容审核</p>' + 
        '<p class="blue-color">任职资格</p>' + 
        '<p>1. 对新媒体拥有全面的了解</p>' + 
        '<p>2. 创意性强，可以针对行业定制不同的推广策略</p>' + 
        '<p>3. 有工业行业工作经验者优先</p>'
	},
	{
		id : "5",
		position : "安全研究实习生",
		site : "北京",
		experience : "在校",
		specialty : "信息安全/自动化/计算机研究生在读",
		email : "",
		content : '<p class="blue-color">岗位职责</p>' + 
        '<p>1. 安全测试、技术研究等相关工作</p>' + 
        '<p>2. 协助调研、跟踪和分析安全界的技术发展情况</p>' + 
        '<p class="blue-color">任职资格</p>' + 
        '<p>1. 研究生学历</p>' + 
        '<p>2. 实习期在5个月以上</p>' + 
        '<p>3. 爱好网络安全，爱好工控领域的安全</p>' + 
        '<p>4. 熟悉渗透测试技术，或熟悉漏洞挖掘</p>' + 
        '<p>5. 对实习工作有激情</p>'
	},
	{
		id : "6",
		position : "高级网络安全工程师",
		site : "北京",
		experience : "3年以上",
		specialty : "信息专业",
		email : "",
		content : '<p class="blue-color">岗位职责</p>' + 
        '<p>1. 产品功能定义与验证</p>' + 
        '<p>2. 产品功能开发策划与测试</p>' + 
        '<p>3. 与研究团队合作开发功能</p>' + 
        '<p class="blue-color">任职资格</p>' + 
        '<p>1. 熟悉工控协议</p>' + 
        '<p>2. 熟悉测试工具，有工控漏洞挖掘经验者优先</p>' + 
        '<p>3. 熟悉逆向分析，有漏洞挖掘经验者优先</p>' + 
        '<p>4. 有一定的编程能力，熟悉C、C++、Java、Python等</p>' + 
        '<p>5. 能独立完成项目模块的设计、开发</p>' + 
        '<p>6. 良好的团队合作精神，较强的沟通能力</p>'
	},
	{
		id : "7",
		position : "底层软件研发",
		site : "北京",
		experience : "4年以上",
		specialty : "计算机专业",
		email : "",
		content : '<p class="blue-color">岗位职责</p>' + 
        '<p>1. 参与业务需求的设计</p>' + 
        '<p>2. 负责需求的分析、设计及关键模块的开发工作</p>' + 
        '<p>3. 现有系统的运维工作</p>' + 
        '<p>4. 为系统实现提出合理化，可行性建议</p>' + 
        '<p class="blue-color">任职资格</p>' + 
        '<p>1. 从事过4年以上linux内核移植和硬件驱动开发</p>' + 
        '<p>2. 精通硬件设备驱动的开发</p>' + 
        '<p>3. 熟悉各种处理器接口</p>'
	},
	{
		id : "8",
		position : "QA - 测试人员",
		site : "北京",
		experience : "5年以上",
		specialty : "计算机专业",
		email : "",
		content : '<p class="blue-color">岗位职责</p>' + 
        '<p>1. 编写产品测试方案和测试计划搭建测试环境，执行产品测试计划，提交测试报告</p>' + 
        '<p>2. 设计和实施自动化测试方案，编写自动化测试脚本</p>' + 
        '<p>3. 跟踪BUG状态，并执行回归测试</p>' + 
        '<p>4. 分析、定位、处理产品故障</p>' + 
        '<p class="blue-color">任职资格</p>' + 
        '<p>1. 三年以上软件测试经验</p>' + 
        '<p>2. 熟练使用至少一种通用脚本语言，如Python，Perl，TCL/TK，Shell等</p>' + 
        '<p>3. 对于TCP/IP协议簇理解深刻</p>' + 
        '<p>4. 熟练使用SmartBits或Ixia等网络测试设备</p>' + 
        '<p>5. 熟悉软件产品开发测试流程</p>' + 
        '<p>6. 熟练使用Linux系统，会配置维护各种主流应用服务器</p>' + 
        '<p>7. 具有网络安全产品开发，测试经验者优先</p>' + 
        '<p>8. 能熟练使用Selenium进行Web应用自动化测试者优先</p>' + 
        '<p>9. 通过CCNP或(和)RHCE认证者优先</p>'
	},
	{
		id : "9",
		position : "系统工程师",
		site : "北京",
		experience : "3年以上",
		specialty : "计算机专业",
		email : "",
		content : '<p class="blue-color">岗位职责</p>' + 
        '<p>1. 提供售前技术咨询</p>' + 
        '<p>2. 开展客户培训</p>' + 
        '<p>3. 对客户提出的技术问题进行解答，并提供完整的解决方案</p>' + 
        '<p class="blue-color">任职资格</p>' + 
        '<p>1. 学历：大学本科及以上</p>' + 
        '<p>2. 对渗透测试、风险管理、安全评估有一定的理论基础和实践经验</p>' + 
        '<p>3. 熟悉安全体系架构，有一定的信息安全项目经验，有相关资格认证者优先考虑</p>' + 
        '<p>4. 了解主流网络安全产品</p>' + 
        '<p>5. 了解工控网络及系统相关知识，对工控相关行业有深刻了解</p>' + 
        '<p>6. 良好的文档组织能力，良好的书面与口头表达能力，能结合安全标准、安全需求撰写相关文档与解决方案</p>' + 
        '<p>7. 有很强的责任心和集体荣誉感，有良好的团队合作精神</p>'
	},
	{
		id : "10",
		position : "安全研究实习生",
		site : "北京",
		experience : "在校",
		specialty : "信息安全/自动化/计算机研究生在读",
		email : "",
		content : '<p class="blue-color">岗位职责</p>' + 
        '<p>1. 安全测试、技术研究等相关工作</p>' + 
        '<p>2. 协助调研、跟踪和分析安全界的技术发展情况</p>' + 
        '<p class="blue-color">任职资格</p>' + 
        '<p>1. 研究生学历</p>' + 
        '<p>2. 实习期在5个月以上</p>' + 
        '<p>3. 爱好网络安全，爱好工控领域的安全</p>' + 
        '<p>4. 熟悉渗透测试技术，或熟悉漏洞挖掘</p>' + 
        '<p>5. 对实习工作有激情</p>'
	}
];

function getCareer(id)
{
	if(creerData < 1)
	{
		return null;
	}

	for(var i = 0;i < creerData.length;i++)
	{
		if(creerData[i].id == id)
		{
			return creerData[i];
		}
	}
	return null;
}